| 返回码                |   说明                | 返回码                |   说明                | 返回码                |   说明                | 返回码                |   说明                |
|-----------------------|:---------------------:|-----------------------|:---------------------:|-----------------------|:---------------------:|-----------------------|:---------------------:|-
|   50101               |   系统错误			|   40001               |   错误调用			    |   40114               |   激活码过期			    |   41210               |   设备需要解锁		    |
|   50102               |   系统错误			|   40002               |   参数错误			    |   40115               |   账户已被冻结	    	|   41211               |   设备需要解锁		    |
|   50103               |   系统错误			|   40003               |   不允许			    |   40116               |   请求sms vldCode太频繁  |   41212               |   数量限制			    |
|   50104               |   系统错误			|   40004               |   资源不存在			|   40117               |   注册太频繁			    |   41213               |   未知型号			    |
|   50105               |   系统错误			|   40005               |   数据错误			    |   40118               |   忘记密码太频繁		    |   41214               |   缺少phyDeviceId		|
|   50106               |   系统错误			|   40006               |   uid不匹配			    |   40152               |   需要重登陆			    |   1100                |   Imlink建立失败		    |
|   50201               |   系统错误			|   40007               |   device id不匹配		|   40154               |   需要刷新token		    |   1101                |   获取WiFi IP地址失败	|
|   50202               |   系统错误			|   40008               |   id不合法			    |   40153               |   缺少refreshToken	    |   1102                |   接收数据解析错误	    |
|   50203               |   系统错误			|   40009               |   缺少id			    |   40301               |   字段类型错误		    |   1103                |   UDP接收数据失败		|
|   50204               |   系统错误			|   40010               |   缺少vrfID			    |   40302               |   数量限制			    |   1104                |   socket连接错误		    |
|   50205               |   系统错误			|   40011               |   验证码错误			|   40303               |   用户系统被引用		    |   1105                |   发送数据，未知主机	    |
|   50206               |   系统错误			|   40012               |   content type错误	    |   40304               |   用户系统不存在		    |   1106                |   UDP发送数据失败		|
|   50207               |   系统错误			|   40013               |   size错误			    |   40401               |   没有权限			    |   1107                |   发送数据解析错误	    |
|   50208               |   系统错误			|   40014               |   间隔错误			    |   40402               |   数量限制			    |   1108                |   设备握手响应超时	    |
|   50209               |   系统错误			|   40015               |   缓存过期			    |   40403               |   App被引用			    |   1109                |   设备设置平台信息超时   |
|   50301               |   系统错误			|   40016               |   验证码过期			|   40404               |   App不存在			    |   1110                |   设备不可用			    |
|   50302               |   系统错误			|   40017               |   已经存在			    |   40405               |   没有appToken		    |   1111                |   创建设备超时		    |
|   50303               |   系统错误			|   40018               |   名称重复			    |   40406               |   token过期			    |   1200                |   创建设备成功		    |
|   50304               |   系统错误			|   40020               |   请重试			    |   40502               |   数量限制			    |   -100                |   网络错误               |
|   50305               |   系统错误			|   40021               |   请求太频繁			|   40503               |   字段类型错误		    |
|   50306               |   系统错误			|   40022               |   name不合法			|   40504               |   产品不存在			    |
|   50307               |   系统错误			|   40023               |   zone不合法			|   40505               |   已经在申请流程中  	    |
|   50308               |   系统错误			|   40024               |   sms数量限制			|   40506               |   不在申请流程中		    |
|   50309               |   系统错误			|   40025               |   签名错误			    |   40602               |   数量限制			    |
|   50310               |   系统错误			|   40026               |   Header错误			|   40603               |   字段类型错误		    |
|   50311               |   系统错误			|   40027               |   上传内容缺失		    |   40604               |   解决方案不存在		    |
|   50312               |   系统错误			|   40101               |   用户未注册			|   41001               |   appid不匹配			|
|   50313               |   系统错误			|   40102               |   用户未激活			|   41101               |   时间戳太旧			    |
|   50314               |   系统错误			|   40103               |   密码错误			    |   41102               |   Auth字段不正确		    |
|   50315               |   系统错误			|   40104               |   缺少stateID			|   41104               |   token不存在			|
|   50316               |   系统错误			|   40105               |   state码错误			|   41201               |   device坐标参数错误	    |
|   50317               |   系统错误			|   40106               |   openid已绑定		    |   41202               |   device纬度参数错误	    |
|   50318               |   系统错误			|   40107               |   帐号已绑定			|   41203               |   device经度参数错误	    |
|   50319               |   系统错误			|   40108               |   用户名已存在		    |   41204               |   设备id已注册		    |
|   50320               |   系统错误			|   40109               |   邮箱已注册			|   41205               |   设备id未注册		    |
|   50321               |   系统错误			|   40110               |   手机号已注册		    |   41206               |   设备id不合法		    |
|   50322               |   系统错误			|   40111               |   需要重登陆			|   41207               |   设备需要在线		    |
|   50323               |   系统错误			|   40112               |   用户名不合法		    |   41208               |   不是设备拥有者		    |
|   50324               |   系统错误			|   40113               |   已关注该用户		    |   41209               |   正在更新token		    |
